In [1]:
import sqlite3
import pandas as pd
import json

# NO. 1

Create Database

In [2]:
def create_db(db):
    #connect to db
    conn = sqlite3.connect(db)
    #create a cursor
    c = conn.cursor()
    #create a table
    c.execute("""CREATE TABLE transactions(
        id UUID,
        insert_time DATETIME,
        tx_amount INT,
        tx_type TEXT,
        status TEXT
        )""")
    #commit out command
    conn.commit()

Insert Records

In [3]:
create_db('case1.db')

In [4]:
many_user = [
    (1,'2021-01-02',20,'buy','open'),
    (2,'2021-01-02',22,'buy','open'),
    (2,'2021-01-03',15,'buy','close'),
    (4,'2021-01-04',17,'sell','close'),
    (5,'2021-01-04',15,'sell','open'),
    (3,'2021-01-04',16,'buy','close'),
    (2,'2021-01-05',40,'sell','open'),
    (4,'2021-01-05',11,'buy','close'),
    (2,'2021-01-06',19,'sell','open'),
    (1,'2021-01-07',25,'sell','open')
]

conn = sqlite3.connect('case1.db')
c = conn.cursor()
c.executemany("INSERT INTO transactions VALUES (?,?,?,?,?)", many_user)
conn.commit()

Query to show the full transaction

In [5]:
c.execute("SELECT * FROM transactions")

items = c.fetchall()

for item in items:
    print(item)

(1, '2021-01-02', 20, 'buy', 'open')
(2, '2021-01-02', 22, 'buy', 'open')
(2, '2021-01-03', 15, 'buy', 'close')
(4, '2021-01-04', 17, 'sell', 'close')
(5, '2021-01-04', 15, 'sell', 'open')
(3, '2021-01-04', 16, 'buy', 'close')
(2, '2021-01-05', 40, 'sell', 'open')
(4, '2021-01-05', 11, 'buy', 'close')
(2, '2021-01-06', 19, 'sell', 'open')
(1, '2021-01-07', 25, 'sell', 'open')

Query to show the latest transaction

In [6]:
query = c.execute("SELECT * FROM transactions GROUP BY id HAVING insert_time == MAX(insert_time)")
cols = [column[0] for column in query.description]
results = pd.DataFrame.from_records(data = query.fetchall(), columns = cols)

In [7]:
results

   id insert_time  tx_amount tx_type status
0   1  2021-01-07         25    sell   open
1   2  2021-01-06         19    sell   open
2   3  2021-01-04         16     buy  close
3   4  2021-01-05         11     buy  close
4   5  2021-01-04         15    sell   open

# NO. 2

In [8]:
def create_db2(db):
    conn = sqlite3.connect(db)
    c = conn.cursor()
    c.execute("""CREATE TABLE datasetb(
        Date DATETIME,
        Sales INT
        )""")
    conn.commit()

In [9]:
create_db2('case2.db')

Insert Records

In [10]:
many_input = [
    ('01/01/21',100),
    ('02/01/21',34),
    ('02/01/21',123),
    ('02/01/21',134),
    ('03/01/21',145),
    ('03/01/21',24),
    ('04/01/21',541),
    ('04/01/21',636),
    ('05/01/21',322),
    ('06/01/21',242),
    ('07/01/21',22),
    ('08/01/21',46)
]

conn = sqlite3.connect('case2.db')
c = conn.cursor()
c.executemany("INSERT INTO datasetb VALUES (?,?)", many_input)
conn.commit()

Query to get the rolling sum total of sales using the window function

In [11]:
c.execute("SELECT Date, SUM(Sales) AS Total_Sales FROM datasetb GROUP BY Date")

items = c.fetchall()

for item in items:
    print(item)

('01/01/21', 100)
('02/01/21', 291)
('03/01/21', 169)
('04/01/21', 1177)
('05/01/21', 322)
('06/01/21', 242)
('07/01/21', 22)
('08/01/21', 46)

In [12]:
query2 = c.execute("SELECT Date, SUM(Sales) AS Total_Sales FROM datasetb GROUP BY Date")
cols = [column[0] for column in query2.description]
results2 = pd.DataFrame.from_records(data = query2.fetchall(), columns = cols)

In [13]:
results2

       Date  Total_Sales
0  01/01/21          100
1  02/01/21          291
2  03/01/21          169
3  04/01/21         1177
4  05/01/21          322
5  06/01/21          242
6  07/01/21           22
7  08/01/21           46

# NO. 3

In [14]:
df = [
   {
       "user": {
           "id": 1,
           "name": "agus",
           "email": "agus@example.com"
       },
       "txs": [
           {
               "id": 1,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 3,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 5,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "sell"
           }
       ]
   },
   {
       "user": {
           "id": 2,
           "name": "asep",
           "email": "asep@example.com"
       },
       "txs": [
           {
               "id": 2,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 4,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 6,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "buy"
           }
       ]
   }
]

In [15]:
df

[{'user': {'id': 1, 'name': 'agus', 'email': 'agus@example.com'},
  'txs': [{'id': 1,
    'tx_date': '2020-01-01',
    'tx_amount': 10,
    'tx_type': 'buy'},
   {'id': 3, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'buy'},
   {'id': 5, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'sell'}]},
 {'user': {'id': 2, 'name': 'asep', 'email': 'asep@example.com'},
  'txs': [{'id': 2,
    'tx_date': '2020-01-01',
    'tx_amount': 10,
    'tx_type': 'sell'},
   {'id': 4, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'sell'},
   {'id': 6, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'buy'}]}]

In [16]:
df = pd.json_normalize(df, record_path=['txs'], meta=[['user','id'],['user','name'],['user','email']])

In [17]:
df.head()

   id     tx_date  tx_amount tx_type user.id user.name        user.email
0   1  2020-01-01         10     buy       1      agus  agus@example.com
1   3  2020-02-01         10     buy       1      agus  agus@example.com
2   5  2020-03-01         20    sell       1      agus  agus@example.com
3   2  2020-01-01         10    sell       2      asep  asep@example.com
4   4  2020-02-01         10    sell       2      asep  asep@example.com

CSV 1

In [18]:
df1 = df[['user.id','id']]
df1.rename(columns = {'user.id':'user_id', 'id':'tx_id'},inplace = True)
df1

C:\Users\niksi.DESKTOP-9H9OB0U\anaconda3\lib\site-packages\pandas\core\frame.py:4296: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

  user_id  tx_id
0       1      1
1       1      3
2       1      5
3       2      2
4       2      4
5       2      6

In [19]:
df1.to_csv('CSV_1.csv')

CSV 2

In [20]:
df2 = df[['id','user.name','user.email']]
df2.rename(columns = {'id':'id', 'user.name':'name', 'user.email':'email' },inplace = True)
df2

C:\Users\niksi.DESKTOP-9H9OB0U\anaconda3\lib\site-packages\pandas\core\frame.py:4296: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

   id  name             email
0   1  agus  agus@example.com
1   3  agus  agus@example.com
2   5  agus  agus@example.com
3   2  asep  asep@example.com
4   4  asep  asep@example.com
5   6  asep  asep@example.com

In [21]:
df2 = df2.drop_duplicates('email')
df2

   id  name             email
0   1  agus  agus@example.com
3   2  asep  asep@example.com

In [22]:
df2.to_csv('CSV_2.csv')

CSV 3

In [23]:
df3 = df[['id','tx_date','tx_amount','tx_type']].sort_values('id')
df3

   id     tx_date  tx_amount tx_type
0   1  2020-01-01         10     buy
3   2  2020-01-01         10    sell
1   3  2020-02-01         10     buy
4   4  2020-02-01         10    sell
2   5  2020-03-01         20    sell
5   6  2020-03-01         20     buy

In [24]:
df3.to_csv('CSV_3.csv')